Table of Contents
 Class ReinfFabric
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Representing fabric reinforcement in IDEA StatiCa Detail
[OpenModelClass(typeof(Reinforcement))]
public class ReinfFabric : Reinforcement
Inheritance
object
OpenObject
OpenElementId
Reinforcement
ReinfFabric
Inherited Members
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ReinfFabric()
constructor
public ReinfFabric()
Properties
 Angle
Rotation of fabric reinforcement related to global X coordinate
public double Angle { get; set; }
Property Value
double
 Cover
Cover of reinforcement
public double Cover { get; set; }
Property Value
double
 CoverFromSetting
Use cover from DetailModelSetting
public bool CoverFromSetting { get; set; }
Property Value
bool
 DiameterX
Bar diameter - direction X
public double DiameterX { get; set; }
Property Value
double
 DiameterY
Bar diameter - direction Y
public double DiameterY { get; set; }
Property Value
double
 DistanceX
Distance between bars - direction X
public double DistanceX { get; set; }
Property Value
double
 DistanceY
Distance between bars - direction Y
public double DistanceY { get; set; }
Property Value
double
 MasterComponent
Master component of reinforcement, if null, fabric reinforcement is in all components
public ReferenceElement MasterComponent { get; set; }
Property Value
ReferenceElement
 Number
number of fabric in wall projection
public int Number { get; set; }
Property Value
int
 Position
Position of bottom left corner of fabric reinforcement related to point number 1 of master wall
public Vector3D Position { get; set; }
Property Value
Vector3D
 SeparatelyPerWall
true - add fabric reinfrocement separatelly for each wall, false - merge walls and add reinforcement on merged shape
public bool SeparatelyPerWall { get; set; }
Property Value
bool
 Edit this page